# 1. Accessing Data with Pandas

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('../../Data/biodiversity-in-national-parks/parks.csv', index_col=['Park Code'])

In [4]:
df.head(3)

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [5]:
df.iloc[2] #특정 row 조회

Park Name    Badlands National Park
State                            SD
Acres                        242756
Latitude                      43.75
Longitude                    -102.5
Name: BADL, dtype: object

In [8]:
df.loc['BADL'] #index_col을 통한 조회

Park Name    Badlands National Park
State                            SD
Acres                        242756
Latitude                      43.75
Longitude                    -102.5
Name: BADL, dtype: object

In [9]:
df.loc[['BADL','ARCH','ACAD']]

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

In [10]:
df.iloc[[2,1,0]]

                        Park Name State   Acres  Latitude  Longitude
Park Code
BADL       Badlands National Park    SD  242756     43.75    -102.50
ARCH         Arches National Park    UT   76519     38.68    -109.57
ACAD         Acadia National Park    ME   47390     44.35     -68.21

In [11]:
df[:3] #slicing 0,1,2

                        Park Name State   Acres  Latitude  Longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [14]:
df[2:6] #slicing 2,3,4,5

,Park Name,State,Acres,Latitude,Longitude
Park Code,,,,,
BADL,Badlands National Park,SD,242756,43.75,-102.50
BIBE,Big Bend National Park,TX,801163,29.25,-103.25
BISC,Biscayne National Park,FL,172924,25.65,-80.08
BLCA,Black Canyon of the Gunnison National Park,CO,32950,38.57,-107.72

In [15]:
df['State'].head(3) #특정 컬럼 조회

Park Code
ACAD    ME
ARCH    UT
BADL    SD
Name: State, dtype: object

In [16]:
df.State.head(3) #single이면 이렇게도 됨

Park Code
ACAD    ME
ARCH    UT
BADL    SD
Name: State, dtype: object

In [28]:
df.columns = [col.replace(' ','_').lower() for col in df.columns]

In [32]:
df.columns

Index(['park_name', 'state', 'acres', 'latitude', 'longitude'], dtype='object')

In [33]:
df[['state','acres']][:3]

          state   acres
Park Code
ACAD         ME   47390
ARCH         UT   76519
BADL         SD  242756

In [38]:
df.state.iloc[2] # Single

'SD'

In [39]:
df.state.iloc[[1,2]] #list

Park Code
ARCH    UT
BADL    SD
Name: state, dtype: object

In [43]:
(df.state == 'UT').head(3) #subset

Park Code
ACAD    False
ARCH     True
BADL    False
Name: state, dtype: bool

In [51]:
df[df.state == 'UT'].head(3)

                            park_name state   acres  latitude  longitude
Park Code
ARCH             Arches National Park    UT   76519     38.68    -109.57
BRCA       Bryce Canyon National Park    UT   35835     37.57    -112.18
CANY        Canyonlands National Park    UT  337598     38.20    -109.93

In [50]:
df[~(df.state == 'UT')].head(3)

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
BADL       Badlands National Park    SD  242756     43.75    -102.50
BIBE       Big Bend National Park    TX  801163     29.25    -103.25

In [54]:
df[(df.latitude>60)&(df.acres >10**6)].head(3)

,park_name,state,acres,latitude,longitude
Park Code,,,,,
DENA,Denali National Park and Preserve,AK,3372402,63.33,-150.50
GAAR,Gates Of The Arctic National Park and Preserve,AK,7523898,67.78,-153.30
KOVA,Kobuk Valley National Park,AK,1750717,67.55,-159.28

In [57]:
df[df['park_name'].str.split().apply(lambda x: len(x) == 3)].head(3)

                        park_name state   acres  latitude  longitude
Park Code
ACAD         Acadia National Park    ME   47390     44.35     -68.21
ARCH         Arches National Park    UT   76519     38.68    -109.57
BADL       Badlands National Park    SD  242756     43.75    -102.50

In [64]:
df[df.state.isin(['WA','OR','CA'])].head() # in

                               park_name state   acres  latitude  longitude
Park Code
CHIS       Channel Islands National Park    CA  249561     34.01    -119.42
CRLA           Crater Lake National Park    OR  183224     42.94    -122.10
JOTR           Joshua Tree National Park    CA  789745     33.79    -115.90
LAVO       Lassen Volcanic National Park    CA  106372     40.49    -121.51
MORA         Mount Rainier National Park    WA  235625     46.85    -121.75

In [66]:
df[df.state.isnull()].head() # null

Empty DataFrame
Columns: [park_name, state, acres, latitude, longitude]
Index: []

# 2. Selecting and Filtering Data

In [70]:
melbourne_data = pd.read_csv('../../Data/melbourne-housing-snapshot/melb_data.csv')

In [71]:
melbourne_data.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Date', 'Distance', 'Postcode', 'Bedroom2', 'Bathroom', 'Car',
       'Landsize', 'BuildingArea', 'YearBuilt', 'CouncilArea', 'Lattitude',
       'Longtitude', 'Regionname', 'Propertycount'],
      dtype='object')

In [72]:
melbourne_price_data = melbourne_data.Price

In [74]:
melbourne_price_data.head()

0    1480000.0
1    1035000.0
2    1465000.0
3     850000.0
4    1600000.0
Name: Price, dtype: float64

In [81]:
two_columns_of_data = melbourne_data[['Landsize','BuildingArea']]

In [82]:
two_columns_of_data.describe()

            Landsize  BuildingArea
count   13580.000000   7130.000000
mean      558.416127    151.967650
std      3990.669241    541.014538
min         0.000000      0.000000
25%       177.000000     93.000000
50%       440.000000    126.000000
75%       651.000000    174.000000
max    433014.000000  44515.000000